# PropertySetElementFailures Properties

---
The BuiltInFailuresPropertySetElementFailures type exposes the following members.
| Name| Description
---|---|---
| EmptyPropertySetName|  A property set name cannot be an empty string.
| NonStringParameterValue|  The given parameter requires a string value.
| NonUniquePropertySetName|  The value of the given parameter is already in use as a property set name.
Top
#### Reference
BuiltInFailuresPropertySetElementFailures Class
Autodesk.Revit.DB Namespace